IDEA StatiCa Open Model
PointSupportNode.SupportTypeRX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Support type in dirrection round X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public SupportTypeInDirrection SupportTypeRX { get; set; }
Public Property SupportTypeRX As SupportTypeInDirrection
	Get
	Set
public:
property SupportTypeInDirrection SupportTypeRX {
	SupportTypeInDirrection get ();
	void set (SupportTypeInDirrection value);
}
Property Value
Type: SupportTypeInDirrection
See Also
Reference
PointSupportNode Class
IdeaRS.OpenModel.Model Namespace